## iloc
### 라벨순 X 정수 int 인덱스만 받는다

In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [3]:
df.iloc[0, 1]

11

In [4]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int32

In [5]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [6]:
df.iloc[-1] = df.iloc[-1] * 2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

### 연습문제

In [ ]:
# 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
df = pd.DataFrame(
    np.arange(1, 26).reshape(5, 5), # arange 5x5 갯수 맞추지않으면 오류가 난다.
    index=["a", "b", "c", "d", "e"],
    columns=["A", "B", "C", "D", "E",]
)

print(df)

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25

In [ ]:
# 10가지 이상 방법으로 특정 행렬을 선택

In [13]:
df["A"]

a     1
b     6
c    11
d    16
e    21
Name: A, dtype: int32

In [19]:
df.head(1)

   A  B  C  D  E
a  1  2  3  4  5

In [20]:
df.tail(2)

    A   B   C   D   E
d  16  17  18  19  20
e  21  22  23  24  25

In [14]:
df.loc[["a", "c", "e"]]

    A   B   C   D   E
a   1   2   3   4   5
c  11  12  13  14  15
e  21  22  23  24  25

In [ ]:
df.loc[df["C"] > 20, ["C", "D"]]

    C   D
e  23  24

In [16]:
df.query("A > 15 and E < 30")

    A   B   C   D   E
d  16  17  18  19  20
e  21  22  23  24  25

In [18]:
df.iloc[2:]

    A   B   C   D   E
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25